# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

print('Введите первое число: ')

a = int(input())
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))

print(a, '+', b, '+', c, '=', a + b + c)
